Documents/Д_КорректировкаДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Д_КорректировкаДокумента</Name>
			<BasedOn>
				<xr:Item>Document.Д_ЗаявкаНаОтгрузку</xr:Item>
				<xr:Item>Document.Д_ЗаявкаНаТорговлю</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОтгрузку</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаТорговлю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяЗадача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийБизнесПроцесс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Comment>Корректируется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПосле</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Д_КорректировкаДокумента/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка, РецензентКомментарий = Неопределено) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Д_КорректировкаДокумента.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Д_КорректировкаДокумента.ДокОснование,
	|	Д_КорректировкаДокумента.ТЧ.(
	|		НомерСтроки,
	|		Реквизит,
	|		ЗначениеДо,
	|		ЗначениеПосле,
	|		Основание
	|	),
	|	Д_КорректировкаДокумента.Ссылка,
	|	Д_КорректировкаДокумента.Дата,
	|	Д_КорректировкаДокумента.Автор
	|ИЗ
	|	Документ.Д_КорректировкаДокумента КАК Д_КорректировкаДокумента
	|ГДЕ
	|	Д_КорректировкаДокумента.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	СогласованиеОбщее.Ссылка КАК БизнесПроцесс,
	//|	СогласованиеОбщее.ДатаНачала КАК ДатаНачала,
	//|	СогласованиеОбщее.ДатаЗавершения,
	//|	СогласованиеОбщее.Описание,
	//|	ВЫБОР
	//|		КОГДА СогласованиеОбщее.Завершен = ЛОЖЬ
	//|			ТОГДА РАЗНОСТЬДАТ(СогласованиеОбщее.ДатаНачала, &ТекДата, МИНУТА) / 60
	//|		ИНАЧЕ РАЗНОСТЬДАТ(СогласованиеОбщее.ДатаНачала, СогласованиеОбщее.ДатаЗавершения, МИНУТА) / 60
	//|	КОНЕЦ КАК ДлительностьЧас,
	//|	ВЫБОР
	//|		КОГДА СогласованиеОбщее.Завершен = ЛОЖЬ
	//|			ТОГДА ""(в процессе)""
	//|		ИНАЧЕ """"
	//|	КОНЕЦ КАК ВПроцессе,
	//|	ВЫБОР
	//|		КОГДА СогласованиеОбщее.Завершен = ЛОЖЬ
	//|			ТОГДА РАЗНОСТЬДАТ(СогласованиеОбщее.ДатаНачала, &ТекДата, МИНУТА)
	//|		ИНАЧЕ РАЗНОСТЬДАТ(СогласованиеОбщее.ДатаНачала, СогласованиеОбщее.ДатаЗавершения, МИНУТА)
	//|	КОНЕЦ КАК ДлительностьМин,
	//|	СогласованиеОбщее.Заявка,
	//|	СогласованиеОбщее.ДопСогласование.(
	//|		Ссылка,
	//|		НомерСтроки,
	//|		СубъектСогласования,
	//|		Согласовано,
	//|		ТочкаДействия,
	//|		Пройден,
	//|		Пользователь,
	//|		Комментарии,
	//|		Автор,
	//|		Пользователь.Должность КАК Должность
	//|	),
	//|	СогласованиеОбщее.Автор
	//|ИЗ
	//|	БизнесПроцесс.СогласованиеОбщее КАК СогласованиеОбщее
	//|ГДЕ
	//|	СогласованиеОбщее.Заявка.Ссылка В(&Заявка)";
	//
	//Запрос.Параметры.Вставить("Заявка", Ссылка);
	//Запрос.Параметры.Вставить("ТекДата", ТекущаяДата());
	//
	//РезультатБП = Запрос.Выполнить();

	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШтампы = Макет.ПолучитьОбласть("Штампы");
	ОбластьСогласование = Макет.ПолучитьОбласть("ШапкаСогласование");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	// статус 
	ШапкаСтатус = Макет.ПолучитьОбласть("ШапкаСтатус");
	ОбластьТЧШапка = Макет.ПолучитьОбласть("ТЧШапка");
	ОбластьТЧ = Макет.ПолучитьОбласть("ТЧ");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		
		// имя пользователя и должность
		ИмяДолжность = БПСервер.ПолучитьИмяИДолжностьПользователя(Выборка.Дата, Выборка.Автор);
		Шапка.Параметры.Автор = Строка(ИмяДолжность.ПредставлениеПользователя) + " " + ?(ЗначениеЗаполнено(ИмяДолжность.Должность), ИмяДолжность.Должность, "");	
			
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		// статус 
		ШапкаСтатус.Параметры.ТекущийСтатус = БПСервер.ПолучитьТекущуюТочкуМаршрута(Ссылка);
		ТабДок.Вывести(ШапкаСтатус, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧШапка);
		ВыборкаТЧ = Выборка.ТЧ.Выбрать();
		Пока ВыборкаТЧ.Следующий() Цикл
			ОбластьТЧ.Параметры.Заполнить(ВыборкаТЧ);
			ТабДок.Вывести(ОбластьТЧ, ВыборкаТЧ.Уровень());
		КонецЦикла;
		
		//показ этапов согласования СЗ
		БПСервер.ПоказатьРецензентов(ТабДок, Выборка.Ссылка, Неопределено, Ссылка, "ОбластьОтметка", РецензентКомментарий);
		
		//ТабДок.НачатьГруппуСтрок("Показать согласование", Истина);
		//
		//СтруктураПоиска = Новый Структура("Заявка", Выборка.Ссылка);
		//ВыборкаБп = РезультатБП.Выбрать();
		//Пока ВыборкаБп.НайтиСледующий(СтруктураПоиска) Цикл
		//	ВыборкаСогласование = ВыборкаБп.ДопСогласование.Выбрать();
		//	
		//	ВыводимШапку = Истина;
		//	
		//	Пока ВыборкаСогласование.Следующий() Цикл
		//		
		//		Если НЕ ПустаяСтрока(ВыборкаСогласование.Пользователь) Тогда
		//			
		//			Если ВыводимШапку Тогда
		//				ТабДок.Вывести(ОбластьСогласование, 1, "Показать согласование", Ложь);			
		//				ВыводимШапку = Ложь;
		//			КонецЕсли;
		//			
		//			// di имя пользователя и должность
		//			
		//			ИмяДолжность = БПСервер.ПолучитьИмяИДолжностьПользователя(ВыборкаСогласование.Ссылка.Дата, ВыборкаСогласование.Пользователь); 
		//			
		//			ОбластьШтампы.Параметры.Пользователь = ИмяДолжность.ПредставлениеПользователя;
		//			ОбластьШтампы.Параметры.Должность = ?(ЗначениеЗаполнено(ИмяДолжность.Должность), ИмяДолжность.Должность, "");
		//												
		//			Оттиск = ВыборкаСогласование.Пользователь.ФайлКартинки;
		//			Если НЕ ПустаяСтрока(Оттиск) Тогда
		//				Картинка = Оттиск.ФайлХранилище.Получить();
		//			Иначе	
		//				Картинка = Новый Картинка;
		//			КонецЕсли;
		//			Если Не Картинка = Неопределено Тогда
		//				ОбластьШтампы.Рисунки.Оттиск.Картинка = Картинка;
		//			КонецЕсли;
		//			ОбластьШтампы.Параметры.Отметка = ?(ВыборкаСогласование.Согласовано, "Да.", "Нет!");
		//			ТабДок.Вывести(ОбластьШтампы, 1, "Показать согласование", Ложь);
		//		КонецЕсли;
		//	КонецЦикла;
		//	
		//	
		//КонецЦикла; 


		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
